---
title: NonContinuousRailStructure
classe: Autodesk.Revit.DB.Architecture.NonContinuousRailStructure
namespace: Autodesk.Revit.DB.Architecture
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 7
---

# NonContinuousRailStructure

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Boolean IsValidObject { get; }` | `nonContinuousRailStructure.IsValidObject` | Boolean |
| `NonContinuousRailInfo AddNonContinuousRail(String, Double, Double)` | `nonContinuousRailStructure.AddNonContinuousRail(name, height, offset)` | NonContinuousRailInfo |
| `Void Dispose()` | `nonContinuousRailStructure.Dispose()` | Void |
| `NonContinuousRailInfo GetNonContinuousRail(Int32)` | `nonContinuousRailStructure.GetNonContinuousRail(index)` | NonContinuousRailInfo |
| `Int32 GetNonContinuousRailCount()` | `nonContinuousRailStructure.GetNonContinuousRailCount()` | Int32 |
| `Boolean IsValidNonContinuousRailProfile(ElementId)` | `nonContinuousRailStructure.IsValidNonContinuousRailProfile(profileId)` | Boolean |
| `Void RemoveNonContinuousRail(Int32)` | `nonContinuousRailStructure.RemoveNonContinuousRail(index)` | Void |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```